{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Phenotypic Co-occurrence\n",
    "One measure enabled by the HPOA disease to phenotype data is phenotypic co-occurrence.  Phenotypic co-occurrence is of interest because it allows us to hypothesize that there is a dependent relationship between two phenotypes.  Although it does not imply causality, it may indicate a causal relationship between two phenotypes and and a third (or more) latent variables, or a causual relationship between two phenotypes. For example, _progressive muscle weakness_ causes _falls_.  Or an alternative example, there is a biological process and/or environmental factor that is causes allergies and asthma to co-occurr.  The latter is of interest in Monarch because we can query biological pathways and processes (GO, Reactome, etc.) related to phenotypes by joining gene-disease-phenotype relationships.  In addition, this type of analysis could  be useful to weight gene to phenotype associations where phenotypes co-occur in a mendelian disease where we have identified a causual gene to disease association.  This analysis could also be used to hypothesize pleiotropic effects.\n",
    "\n",
    "For simplicitiy, we will treat all phenotypes and diseases as flat (or leaf nodes) in our disease to phenotype association data.  In practice we know this is not correct, and both phenotype groups and disease groups appear in the association data.\n",
    "\n",
    "#### Approach\n",
    "We will query the HPOA association data using the Monarch Neo4J database.  These values may differ from querying the raw dataset due to merging equivalent diseases in MONDO.\n",
    "\n",
    "This analysis assumes we are starting with a phenotype of interest.  Although a more comprehensive analyses, as in generating a co-occurrence matrix, may also be useful.\n",
    "\n",
    "\n",
    "#### About this notebook\n",
    "This notebook uses the _Prominent nasal bridge_ as an example phenotype.  This can be changed in the second cell to analyze different phenotypes.\n",
    "\n",
    "Dependencies:\n",
    "\n",
    "* pip install requests\n",
    "* pip install pandas\n",
    "* pip install neo4j-driver"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 61,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "+--------------------------------------------------+\n",
      "| phenotype                        | disease_count |\n",
      "+--------------------------------------------------+\n",
      "| \"Global developmental delay\"     | 68            |\n",
      "| \"Microcephaly\"                   | 68            |\n",
      "| \"Short stature\"                  | 67            |\n",
      "| \"Intellectual disability\"        | 65            |\n",
      "| \"Seizures\"                       | 51            |\n",
      "| \"Micrognathia\"                   | 48            |\n",
      "| \"Downslanted palpebral fissures\" | 46            |\n",
      "| \"Cryptorchidism\"                 | 45            |\n",
      "| \"High palate\"                    | 45            |\n",
      "| \"Low-set ears\"                   | 43            |\n",
      "+--------------------------------------------------+\n",
      "10 rows\n",
      "\n"
     ]
    }
   ],
   "source": [
    "import requests\n",
    "\n",
    "# Query the Monarch database for co-occurrence of prominent nasal bridge and other phenotypes\n",
    "# This can performed using a count aggregate function in cypher\n",
    "\n",
    "phenotype = \"HP:0000426\" # Prominent nasal bridge\n",
    "\n",
    "SCIGRAPH = \"https://scigraph-data-dev.monarchinitiative.org/scigraph/\"\n",
    "scigraph_exec = SCIGRAPH + \"cypher/execute\"\n",
    "scigraph_resolve = SCIGRAPH + \"cypher/resolve\"\n",
    "\n",
    "# The WHERE p1 <> p2 because clique merging of diseases causes\n",
    "# duplicate edges, need to fix\n",
    "cypher_query = \"\"\"\n",
    "    MATCH (disease:disease)-[:RO:0002200]->(p1:Node{iri:'%s'}),\n",
    "          (disease)-[:RO:0002200]->(p2:Node)\n",
    "    WHERE p1 <> p2\n",
    "    RETURN p2.label as phenotype, COUNT(DISTINCT(disease)) as disease_count\n",
    "    ORDER BY disease_count DESC\n",
    "\"\"\" % phenotype\n",
    "\n",
    "params = {\n",
    "    'cypherQuery': cypher_query,\n",
    "    'limit': 10\n",
    "}\n",
    "\n",
    "scigraph_req = requests.get(scigraph_exec, params=params)\n",
    "print(scigraph_req.text) # Default format is ascii text table, but we can get back json"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Normalization\n",
    "We know that the distribution of phenotypes across diseases is not uniform.  In other words, some phenotypes are annnotated to diseases more often than others.  Therefore, we need to normalize this data.  This is not to be confused with the frequency that a patient presents with a phenotype or expressivity.\n",
    "\n",
    "Two common methods for normalizing co-occurrence data are Jaccard similarity and Cosine similarity.\n",
    "\n",
    "Given two phenotypes, P1 and P2, we define jaccard similarity as the count of diseases that contain both P1 AND P2, divided by the count of diseases that contain either P1 OR P2, or:\n",
    "\n",
    "$$Jaccard(P1,P2) = \\frac{\\mid \\ P1 \\cap P2 \\ \\mid}{\\mid\\  P1 \\mid + \\mid P2 \\mid - \\mid P1 \\cap P2 \\ \\mid }$$\n",
    "\n",
    "Where \n",
    "$$ \\mid \\  P \\mid = \\text{Number of diseases annotated to phenotype P} $$\n",
    "\n",
    "\n",
    "\n",
    "For cosine similarity we will use the Ochiai coefficient, which is defined as the count of diseases that contain both P1 AND P2, divided by the square root of the product of the count of diseases that contain P1 and the count of the diseases that contain P2, or:\n",
    "\n",
    "$$\\text{Ochiai coefficient(P1,P2)} = \\frac{\\mid P1 \\cap P2 \\mid}{\\sqrt{\\mid \\ P1 \\mid \\times \\mid P2 \\ \\mid}}$$\n",
    "\n",
    "#### Approach\n",
    "This can achieved in pure cypher, but we may consider creating a function on the server.\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 62,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "+---------------------------------------------------------------------------------------------+\n",
      "| phenotype                        | p1_count | p2_count | intersection | jaccard_sim         |\n",
      "+---------------------------------------------------------------------------------------------+\n",
      "| \"Long face\"                      | 130      | 117      | 27           | 0.12272727272727273 |\n",
      "| \"Highly arched eyebrow\"          | 130      | 103      | 22           | 0.10426540284360189 |\n",
      "| \"Downslanted palpebral fissures\" | 130      | 374      | 46           | 0.10043668122270742 |\n",
      "| \"High palate\"                    | 130      | 430      | 45           | 0.08737864077669903 |\n",
      "| \"Thin vermilion border\"          | 130      | 110      | 19           | 0.08597285067873303 |\n",
      "| \"Short philtrum\"                 | 130      | 152      | 22           | 0.08461538461538462 |\n",
      "| \"Posteriorly rotated ears\"       | 130      | 186      | 24           | 0.0821917808219178  |\n",
      "| \"Macrotia\"                       | 130      | 191      | 24           | 0.08080808080808081 |\n",
      "| \"Narrow mouth\"                   | 130      | 210      | 25           | 0.07936507936507936 |\n",
      "| \"Sloping forehead\"               | 130      | 89       | 16           | 0.07881773399014778 |\n",
      "+---------------------------------------------------------------------------------------------+\n",
      "10 rows\n",
      "\n"
     ]
    }
   ],
   "source": [
    "# Normalize with jaccard similarity\n",
    "cypher_query = \"\"\"\n",
    "    MATCH (disease:disease)-[:RO:0002200]->(p1:Node{iri:'%s'}),\n",
    "          (disease)-[:RO:0002200]->(p2:Phenotype)\n",
    "    WHERE p2 <> p1\n",
    "    WITH p2, COUNT(DISTINCT(disease)) as co_count\n",
    "    MATCH (disease:disease)-[:RO:0002200]->(p1:Node{iri:'%s'})\n",
    "    WITH COUNT(DISTINCT(disease)) as p1_count, p2, co_count\n",
    "    MATCH (disease:disease)-[:RO:0002200]->(p2)\n",
    "    WITH COUNT(DISTINCT(disease)) as p2_count, p1_count, p2, co_count\n",
    "    RETURN p2.label as phenotype, p1_count, p2_count, co_count as intersection,\n",
    "           toFloat(co_count)/((p1_count + p2_count)-co_count) as jaccard_sim\n",
    "    ORDER BY jaccard_sim DESC\n",
    "    \"\"\" % (phenotype, phenotype)\n",
    "\n",
    "params = {\n",
    "    'cypherQuery': cypher_query,\n",
    "    'limit': 10\n",
    "}\n",
    "\n",
    "scigraph_req = requests.get(scigraph_exec, params=params)\n",
    "print(scigraph_req.text) # Default format is ascii text table, but we can get back json"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 68,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "+---------------------------------------------------------------------------------------------+\n",
      "| phenotype                        | p1_count | p2_count | intersection | ochai_coef          |\n",
      "+---------------------------------------------------------------------------------------------+\n",
      "| \"Long face\"                      | 130      | 117      | 27           | 0.21892691493473396 |\n",
      "| \"Downslanted palpebral fissures\" | 130      | 374      | 46           | 0.20861731638973618 |\n",
      "| \"Microcephaly\"                   | 130      | 945      | 68           | 0.19400875660494718 |\n",
      "| \"High palate\"                    | 130      | 430      | 45           | 0.1903297204970161  |\n",
      "| \"Highly arched eyebrow\"          | 130      | 103      | 22           | 0.19012200791583994 |\n",
      "| \"Short stature\"                  | 130      | 1187     | 67           | 0.17056022767438492 |\n",
      "| \"Low-set ears\"                   | 130      | 490      | 43           | 0.17037220312632037 |\n",
      "| \"Ptosis\"                         | 130      | 502      | 42           | 0.16440906355110274 |\n",
      "| \"Micrognathia\"                   | 130      | 659      | 48           | 0.16399358273778858 |\n",
      "| \"Cryptorchidism\"                 | 130      | 585      | 45           | 0.16317848796612636 |\n",
      "+---------------------------------------------------------------------------------------------+\n",
      "10 rows\n",
      "\n"
     ]
    }
   ],
   "source": [
    "# Normalize with ochiai coefficient\n",
    "ochiai_query = \"\"\"\n",
    "    MATCH (disease:disease)-[:RO:0002200]->(p1:Node{iri:'%s'}),\n",
    "          (disease)-[:RO:0002200]->(p2:Phenotype)\n",
    "    WHERE p1 <> p2\n",
    "    WITH DISTINCT p1, p2, disease\n",
    "    WITH p2, COUNT(DISTINCT(disease)) as co_count\n",
    "    MATCH (disease:disease)-[:RO:0002200]->(p1:Node{iri:'%s'})\n",
    "    WITH COUNT(DISTINCT(disease)) as p1_count, p2, co_count\n",
    "    MATCH (disease:disease)-[:RO:0002200]->(p2)\n",
    "    WITH COUNT(DISTINCT(disease)) as p2_count, p1_count, p2, co_count\n",
    "    RETURN p2.label as phenotype, p1_count, p2_count, co_count as intersection,\n",
    "    toFloat(co_count)/sqrt(p1_count * p2_count) as ochai_coef\n",
    "    ORDER BY ochai_coef DESC\n",
    "    \"\"\" % (phenotype, phenotype)\n",
    "\n",
    "params = {\n",
    "    'cypherQuery': ochiai_query,\n",
    "    'limit': 10\n",
    "}\n",
    "\n",
    "scigraph_req = requests.get(scigraph_exec, params=params)\n",
    "print(scigraph_req.text) # Default format is ascii text table, but we can get back json"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Results\n",
    "The original results showed several neurological abnormalities: seizures, global development delay, intellecutal disability.  In contrast, after normalization the majority of co-occurring phenotypes are related to morphilogical abnormalities of the head, with the exception of cryptorchidism.\n",
    "\n",
    "#### Computing p-values for co-occurrence\n",
    "Similarity metrics are useful in normalizing and ranking co-occurrence data; however, it doesn't measure if a pair of phenotypes significantly co-occur in our corpus.\n",
    "\n",
    "In order to compute the probability that the two phenotypes are independent, we create a 2x2 contigency table and run a one tailed fisher's exact test.  The contingency table is structured as:\n",
    "\n",
    "\n",
    "|     | P1 Present     |  P1 Absent |\n",
    "|:-------------|:----------------:|:--------:|\n",
    "|__P2 Present__      |A   | B |\n",
    "|__P2 Absent__     |C  |D  |\n",
    "\n",
    "Given the variables in the contingency table, jaccard similarity could be rewritten as:\n",
    "\n",
    "$$Jaccard(P1,P2) = \\frac{A}{A + B + C}$$\n",
    "\n",
    "For those coming from a GO term enrichment perspective, this can also be conceptualized as testing for enrichment on the class P1 where our selected dataset is diseases with P2, and our unselected dataset is diseases without P2, or:\n",
    "\n",
    "|     | P1 Present     |  P1 Absent |\n",
    "|:-------------|:----------------:|:--------:|\n",
    "|Sample group (diseases with P2)      |A   | B |\n",
    "|Background (diseases without P2)     |C  |D  |\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 83,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "# There are a couple libs that compute the fisher's exact test:\n",
    "# scipy, https://github.com/brentp/fishers_exact_test,\n",
    "# but it's easy enough to rewrite for a 2x2 table\n",
    "\n",
    "# References: https://en.wikipedia.org/wiki/Fisher%27s_exact_test\n",
    "# This is also a good bio related description:\n",
    "# http://www.pathwaycommons.org/guide/primers/statistics/fishers_exact_test/#setup\n",
    "\n",
    "import math\n",
    "\n",
    "\n",
    "def hyper_geometric(matrix):\n",
    "    a = matrix[0][0]\n",
    "    b = matrix[0][1]\n",
    "    c = matrix[1][0]\n",
    "    d = matrix[1][1]\n",
    "    numerator = math.factorial(a + b) * math.factorial(c + d) \\\n",
    "                * math.factorial(a + c) * math.factorial(b + d)\n",
    "    denominator = math.factorial(a) * math.factorial(b) \\\n",
    "                  * math.factorial(c) * math.factorial(d) \\\n",
    "                  * math.factorial(a + b + c + d)\n",
    "    return numerator/denominator\n",
    "\n",
    "\n",
    "def fisher_exact(matrix, direction=\"greater\"):\n",
    "    p_value =  hyper_geometric(matrix)\n",
    "    if direction == \"greater\":\n",
    "        while matrix[0][1] > 0 and matrix[1][0] > 0:\n",
    "            matrix[0][0] += 1\n",
    "            matrix[0][1] -= 1\n",
    "            matrix[1][0] -= 1\n",
    "            matrix[1][1] += 1\n",
    "            p_value += hyper_geometric(matrix)\n",
    "\n",
    "    elif direction == \"lesser\":\n",
    "        while matrix[0][0] > 0 and matrix[1][1] > 0:\n",
    "            matrix[0][0] -= 1\n",
    "            matrix[0][1] += 1\n",
    "            matrix[1][0] += 1\n",
    "            matrix[1][1] -= 1\n",
    "            p_value += hyper_geometric(matrix)\n",
    "    else:\n",
    "        raise ValueError(\"only accepts greater or lesser\")\n",
    "    return p_value"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 84,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style>\n",
       "    .dataframe thead tr:only-child th {\n",
       "        text-align: right;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: left;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>intersection</th>\n",
       "      <th>ochai_coef</th>\n",
       "      <th>p1_count</th>\n",
       "      <th>p2_count</th>\n",
       "      <th>p_value</th>\n",
       "      <th>phenotype</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>27.0</td>\n",
       "      <td>0.218927</td>\n",
       "      <td>130.0</td>\n",
       "      <td>117.0</td>\n",
       "      <td>7.294206e-28</td>\n",
       "      <td>Long face</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>46.0</td>\n",
       "      <td>0.208617</td>\n",
       "      <td>130.0</td>\n",
       "      <td>374.0</td>\n",
       "      <td>7.820636e-35</td>\n",
       "      <td>Downslanted palpebral fissures</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>68.0</td>\n",
       "      <td>0.194009</td>\n",
       "      <td>130.0</td>\n",
       "      <td>945.0</td>\n",
       "      <td>3.249306e-38</td>\n",
       "      <td>Microcephaly</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>45.0</td>\n",
       "      <td>0.190330</td>\n",
       "      <td>130.0</td>\n",
       "      <td>430.0</td>\n",
       "      <td>6.668261e-31</td>\n",
       "      <td>High palate</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>22.0</td>\n",
       "      <td>0.190122</td>\n",
       "      <td>130.0</td>\n",
       "      <td>103.0</td>\n",
       "      <td>5.388294e-22</td>\n",
       "      <td>Highly arched eyebrow</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>67.0</td>\n",
       "      <td>0.170560</td>\n",
       "      <td>130.0</td>\n",
       "      <td>1187.0</td>\n",
       "      <td>6.076037e-31</td>\n",
       "      <td>Short stature</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>43.0</td>\n",
       "      <td>0.170372</td>\n",
       "      <td>130.0</td>\n",
       "      <td>490.0</td>\n",
       "      <td>2.831551e-26</td>\n",
       "      <td>Low-set ears</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>42.0</td>\n",
       "      <td>0.164409</td>\n",
       "      <td>130.0</td>\n",
       "      <td>502.0</td>\n",
       "      <td>8.355355e-25</td>\n",
       "      <td>Ptosis</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>48.0</td>\n",
       "      <td>0.163994</td>\n",
       "      <td>130.0</td>\n",
       "      <td>659.0</td>\n",
       "      <td>6.779898e-26</td>\n",
       "      <td>Micrognathia</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>45.0</td>\n",
       "      <td>0.163178</td>\n",
       "      <td>130.0</td>\n",
       "      <td>585.0</td>\n",
       "      <td>3.819463e-25</td>\n",
       "      <td>Cryptorchidism</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   intersection  ochai_coef  p1_count  p2_count       p_value  \\\n",
       "0          27.0    0.218927     130.0     117.0  7.294206e-28   \n",
       "1          46.0    0.208617     130.0     374.0  7.820636e-35   \n",
       "2          68.0    0.194009     130.0     945.0  3.249306e-38   \n",
       "3          45.0    0.190330     130.0     430.0  6.668261e-31   \n",
       "4          22.0    0.190122     130.0     103.0  5.388294e-22   \n",
       "5          67.0    0.170560     130.0    1187.0  6.076037e-31   \n",
       "6          43.0    0.170372     130.0     490.0  2.831551e-26   \n",
       "7          42.0    0.164409     130.0     502.0  8.355355e-25   \n",
       "8          48.0    0.163994     130.0     659.0  6.779898e-26   \n",
       "9          45.0    0.163178     130.0     585.0  3.819463e-25   \n",
       "\n",
       "                        phenotype  \n",
       "0                       Long face  \n",
       "1  Downslanted palpebral fissures  \n",
       "2                    Microcephaly  \n",
       "3                     High palate  \n",
       "4           Highly arched eyebrow  \n",
       "5                   Short stature  \n",
       "6                    Low-set ears  \n",
       "7                          Ptosis  \n",
       "8                    Micrognathia  \n",
       "9                  Cryptorchidism  "
      ]
     },
     "execution_count": 84,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "import pandas as pd\n",
    "\n",
    "\n",
    "# Get input for fisher's exact\n",
    "\n",
    "params = {\n",
    "    'cypherQuery': ochiai_query,\n",
    "    'limit': 50\n",
    "}\n",
    "\n",
    "scigraph_req = requests.get(scigraph_exec + \".json\", params=params)\n",
    "cooccur_table = scigraph_req.json()\n",
    "\n",
    "# Get count of diseases with phenotypes\n",
    "# Get input for fisher's exact\n",
    "\n",
    "cypher_query = \"\"\"\n",
    "    MATCH (disease:disease)-[:RO:0002200]->(:Phenotype)\n",
    "    RETURN COUNT(DISTINCT(disease)) as count\n",
    "\"\"\"\n",
    "\n",
    "params = {\n",
    "    'cypherQuery': cypher_query,\n",
    "    'limit': 1\n",
    "}\n",
    "\n",
    "scigraph_req = requests.get(scigraph_exec + \".json\", params=params)\n",
    "disease_count = scigraph_req.json()[0]['count']\n",
    "\n",
    "result_table = pd.DataFrame()\n",
    "\n",
    "for result in cooccur_table:\n",
    "    row = {}\n",
    "    row['phenotype'] = result['phenotype']\n",
    "    row['p1_count'] = result['p1_count']\n",
    "    row['p2_count'] = result['p2_count']\n",
    "    row['intersection'] = result['intersection']\n",
    "    row['ochai_coef'] = result['ochai_coef']\n",
    "    p1_only = result['p1_count'] - result['intersection']\n",
    "    p2_only = result['p2_count'] - result['intersection']\n",
    "    matrix = [[result['intersection'], p2_only],\n",
    "              [ p1_only, (disease_count - p2_only - p1_only - result['intersection'])]]\n",
    "    row['p_value'] = fisher_exact(matrix)\n",
    "    result_table = result_table.append(row, ignore_index=True)\n",
    "    \n",
    "result_table.sort_values(by=['ochai_coef'], ascending=False).head(10)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Correcting p-values\n",
    "\n",
    "For p-value correction we'll use Bonferroni correction.  To apply Bonferonni correction we multiply the uncorrected p value by the number of comparisons or hypotheses we are generating.  To determine the number of possible co-occurring phenotypes we take the binomial coefficient, or n choose k, where n is two and k is the count of all phenotypes with at least one disease annotation."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 86,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style>\n",
       "    .dataframe thead tr:only-child th {\n",
       "        text-align: right;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: left;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>intersection</th>\n",
       "      <th>ochai_coef</th>\n",
       "      <th>p1_count</th>\n",
       "      <th>p2_count</th>\n",
       "      <th>p_value</th>\n",
       "      <th>phenotype</th>\n",
       "      <th>corrected_pval</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>27.0</td>\n",
       "      <td>0.218927</td>\n",
       "      <td>130.0</td>\n",
       "      <td>117.0</td>\n",
       "      <td>7.294206e-28</td>\n",
       "      <td>Long face</td>\n",
       "      <td>2.736114e-20</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>46.0</td>\n",
       "      <td>0.208617</td>\n",
       "      <td>130.0</td>\n",
       "      <td>374.0</td>\n",
       "      <td>7.820636e-35</td>\n",
       "      <td>Downslanted palpebral fissures</td>\n",
       "      <td>2.933582e-27</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>68.0</td>\n",
       "      <td>0.194009</td>\n",
       "      <td>130.0</td>\n",
       "      <td>945.0</td>\n",
       "      <td>3.249306e-38</td>\n",
       "      <td>Microcephaly</td>\n",
       "      <td>1.218840e-30</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>45.0</td>\n",
       "      <td>0.190330</td>\n",
       "      <td>130.0</td>\n",
       "      <td>430.0</td>\n",
       "      <td>6.668261e-31</td>\n",
       "      <td>High palate</td>\n",
       "      <td>2.501317e-23</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>22.0</td>\n",
       "      <td>0.190122</td>\n",
       "      <td>130.0</td>\n",
       "      <td>103.0</td>\n",
       "      <td>5.388294e-22</td>\n",
       "      <td>Highly arched eyebrow</td>\n",
       "      <td>2.021192e-14</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>67.0</td>\n",
       "      <td>0.170560</td>\n",
       "      <td>130.0</td>\n",
       "      <td>1187.0</td>\n",
       "      <td>6.076037e-31</td>\n",
       "      <td>Short stature</td>\n",
       "      <td>2.279170e-23</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>43.0</td>\n",
       "      <td>0.170372</td>\n",
       "      <td>130.0</td>\n",
       "      <td>490.0</td>\n",
       "      <td>2.831551e-26</td>\n",
       "      <td>Low-set ears</td>\n",
       "      <td>1.062137e-18</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>42.0</td>\n",
       "      <td>0.164409</td>\n",
       "      <td>130.0</td>\n",
       "      <td>502.0</td>\n",
       "      <td>8.355355e-25</td>\n",
       "      <td>Ptosis</td>\n",
       "      <td>3.134160e-17</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>48.0</td>\n",
       "      <td>0.163994</td>\n",
       "      <td>130.0</td>\n",
       "      <td>659.0</td>\n",
       "      <td>6.779898e-26</td>\n",
       "      <td>Micrognathia</td>\n",
       "      <td>2.543193e-18</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>45.0</td>\n",
       "      <td>0.163178</td>\n",
       "      <td>130.0</td>\n",
       "      <td>585.0</td>\n",
       "      <td>3.819463e-25</td>\n",
       "      <td>Cryptorchidism</td>\n",
       "      <td>1.432711e-17</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   intersection  ochai_coef  p1_count  p2_count       p_value  \\\n",
       "0          27.0    0.218927     130.0     117.0  7.294206e-28   \n",
       "1          46.0    0.208617     130.0     374.0  7.820636e-35   \n",
       "2          68.0    0.194009     130.0     945.0  3.249306e-38   \n",
       "3          45.0    0.190330     130.0     430.0  6.668261e-31   \n",
       "4          22.0    0.190122     130.0     103.0  5.388294e-22   \n",
       "5          67.0    0.170560     130.0    1187.0  6.076037e-31   \n",
       "6          43.0    0.170372     130.0     490.0  2.831551e-26   \n",
       "7          42.0    0.164409     130.0     502.0  8.355355e-25   \n",
       "8          48.0    0.163994     130.0     659.0  6.779898e-26   \n",
       "9          45.0    0.163178     130.0     585.0  3.819463e-25   \n",
       "\n",
       "                        phenotype  corrected_pval  \n",
       "0                       Long face    2.736114e-20  \n",
       "1  Downslanted palpebral fissures    2.933582e-27  \n",
       "2                    Microcephaly    1.218840e-30  \n",
       "3                     High palate    2.501317e-23  \n",
       "4           Highly arched eyebrow    2.021192e-14  \n",
       "5                   Short stature    2.279170e-23  \n",
       "6                    Low-set ears    1.062137e-18  \n",
       "7                          Ptosis    3.134160e-17  \n",
       "8                    Micrognathia    2.543193e-18  \n",
       "9                  Cryptorchidism    1.432711e-17  "
      ]
     },
     "execution_count": 86,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Calculate bonferroni correction\n",
    "# Source: https://en.wikipedia.org/wiki/Bonferroni_correction\n",
    "\n",
    "cypher_query = \"\"\"\n",
    "    MATCH (disease:disease)-[:RO:0002200]->(p:Phenotype)\n",
    "    RETURN COUNT(DISTINCT(p)) as count\n",
    "\"\"\"\n",
    "\n",
    "params = {\n",
    "    'cypherQuery': cypher_query,\n",
    "    'limit': 1\n",
    "}\n",
    "\n",
    "scigraph_req = requests.get(scigraph_exec + \".json\", params=params)\n",
    "phenotype_count = scigraph_req.json()[0]['count']\n",
    "\n",
    "def n_choose_k(n, k):\n",
    "    return math.factorial(n) / (math.factorial(k) * math.factorial(n - k))\n",
    "\n",
    "comparisons = n_choose_k(phenotype_count, 2)\n",
    "\n",
    "for index, row in result_table.iterrows():\n",
    "    corrected_pval = row['p_value'] * comparisons\n",
    "    result_table.loc[index,'corrected_pval'] = corrected_pval\n",
    "    \n",
    "result_table.sort_values(by=['ochai_coef'], ascending=False).head(10)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 89,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style>\n",
       "    .dataframe thead tr:only-child th {\n",
       "        text-align: right;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: left;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>intersection</th>\n",
       "      <th>ochai_coef</th>\n",
       "      <th>p1_count</th>\n",
       "      <th>p2_count</th>\n",
       "      <th>p_value</th>\n",
       "      <th>phenotype</th>\n",
       "      <th>corrected_pval</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>37</th>\n",
       "      <td>2.0</td>\n",
       "      <td>0.124035</td>\n",
       "      <td>130.0</td>\n",
       "      <td>2.0</td>\n",
       "      <td>1.415260e-04</td>\n",
       "      <td>Cat cry</td>\n",
       "      <td>5308.753026</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>44</th>\n",
       "      <td>4.0</td>\n",
       "      <td>0.116941</td>\n",
       "      <td>130.0</td>\n",
       "      <td>9.0</td>\n",
       "      <td>2.336082e-06</td>\n",
       "      <td>Oval face</td>\n",
       "      <td>87.628273</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>4.0</td>\n",
       "      <td>0.143223</td>\n",
       "      <td>130.0</td>\n",
       "      <td>6.0</td>\n",
       "      <td>2.859711e-07</td>\n",
       "      <td>Conspicuously happy disposition</td>\n",
       "      <td>10.727002</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>35</th>\n",
       "      <td>5.0</td>\n",
       "      <td>0.126592</td>\n",
       "      <td>130.0</td>\n",
       "      <td>12.0</td>\n",
       "      <td>1.665228e-07</td>\n",
       "      <td>Profound global developmental delay</td>\n",
       "      <td>6.246404</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>40</th>\n",
       "      <td>6.0</td>\n",
       "      <td>0.120727</td>\n",
       "      <td>130.0</td>\n",
       "      <td>19.0</td>\n",
       "      <td>6.170429e-08</td>\n",
       "      <td>Narrow nose</td>\n",
       "      <td>2.314577</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>46</th>\n",
       "      <td>12.0</td>\n",
       "      <td>0.115524</td>\n",
       "      <td>130.0</td>\n",
       "      <td>83.0</td>\n",
       "      <td>2.375031e-10</td>\n",
       "      <td>Prominent nose</td>\n",
       "      <td>0.008909</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>48</th>\n",
       "      <td>14.0</td>\n",
       "      <td>0.114501</td>\n",
       "      <td>130.0</td>\n",
       "      <td>115.0</td>\n",
       "      <td>7.570281e-11</td>\n",
       "      <td>Hypoplasia of the maxilla</td>\n",
       "      <td>0.002840</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>47</th>\n",
       "      <td>14.0</td>\n",
       "      <td>0.115002</td>\n",
       "      <td>130.0</td>\n",
       "      <td>114.0</td>\n",
       "      <td>6.715816e-11</td>\n",
       "      <td>Downturned corners of mouth</td>\n",
       "      <td>0.002519</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>42</th>\n",
       "      <td>14.0</td>\n",
       "      <td>0.117610</td>\n",
       "      <td>130.0</td>\n",
       "      <td>109.0</td>\n",
       "      <td>3.621595e-11</td>\n",
       "      <td>Thick eyebrow</td>\n",
       "      <td>0.001358</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>49</th>\n",
       "      <td>17.0</td>\n",
       "      <td>0.114354</td>\n",
       "      <td>130.0</td>\n",
       "      <td>170.0</td>\n",
       "      <td>1.547818e-11</td>\n",
       "      <td>High forehead</td>\n",
       "      <td>0.000581</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>45</th>\n",
       "      <td>16.0</td>\n",
       "      <td>0.116941</td>\n",
       "      <td>130.0</td>\n",
       "      <td>144.0</td>\n",
       "      <td>1.271950e-11</td>\n",
       "      <td>Protruding ear</td>\n",
       "      <td>0.000477</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>39</th>\n",
       "      <td>17.0</td>\n",
       "      <td>0.121740</td>\n",
       "      <td>130.0</td>\n",
       "      <td>150.0</td>\n",
       "      <td>2.005483e-12</td>\n",
       "      <td>Thin upper lip vermilion</td>\n",
       "      <td>0.000075</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>41</th>\n",
       "      <td>19.0</td>\n",
       "      <td>0.118427</td>\n",
       "      <td>130.0</td>\n",
       "      <td>198.0</td>\n",
       "      <td>1.873964e-12</td>\n",
       "      <td>Brachycephaly</td>\n",
       "      <td>0.000070</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>13.0</td>\n",
       "      <td>0.140346</td>\n",
       "      <td>130.0</td>\n",
       "      <td>66.0</td>\n",
       "      <td>6.532169e-13</td>\n",
       "      <td>Narrow face</td>\n",
       "      <td>0.000025</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>36</th>\n",
       "      <td>17.0</td>\n",
       "      <td>0.126012</td>\n",
       "      <td>130.0</td>\n",
       "      <td>140.0</td>\n",
       "      <td>6.390490e-13</td>\n",
       "      <td>Arachnodactyly</td>\n",
       "      <td>0.000024</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "    intersection  ochai_coef  p1_count  p2_count       p_value  \\\n",
       "37           2.0    0.124035     130.0       2.0  1.415260e-04   \n",
       "44           4.0    0.116941     130.0       9.0  2.336082e-06   \n",
       "23           4.0    0.143223     130.0       6.0  2.859711e-07   \n",
       "35           5.0    0.126592     130.0      12.0  1.665228e-07   \n",
       "40           6.0    0.120727     130.0      19.0  6.170429e-08   \n",
       "46          12.0    0.115524     130.0      83.0  2.375031e-10   \n",
       "48          14.0    0.114501     130.0     115.0  7.570281e-11   \n",
       "47          14.0    0.115002     130.0     114.0  6.715816e-11   \n",
       "42          14.0    0.117610     130.0     109.0  3.621595e-11   \n",
       "49          17.0    0.114354     130.0     170.0  1.547818e-11   \n",
       "45          16.0    0.116941     130.0     144.0  1.271950e-11   \n",
       "39          17.0    0.121740     130.0     150.0  2.005483e-12   \n",
       "41          19.0    0.118427     130.0     198.0  1.873964e-12   \n",
       "25          13.0    0.140346     130.0      66.0  6.532169e-13   \n",
       "36          17.0    0.126012     130.0     140.0  6.390490e-13   \n",
       "\n",
       "                              phenotype  corrected_pval  \n",
       "37                              Cat cry     5308.753026  \n",
       "44                            Oval face       87.628273  \n",
       "23      Conspicuously happy disposition       10.727002  \n",
       "35  Profound global developmental delay        6.246404  \n",
       "40                          Narrow nose        2.314577  \n",
       "46                       Prominent nose        0.008909  \n",
       "48            Hypoplasia of the maxilla        0.002840  \n",
       "47          Downturned corners of mouth        0.002519  \n",
       "42                        Thick eyebrow        0.001358  \n",
       "49                        High forehead        0.000581  \n",
       "45                       Protruding ear        0.000477  \n",
       "39             Thin upper lip vermilion        0.000075  \n",
       "41                        Brachycephaly        0.000070  \n",
       "25                          Narrow face        0.000025  \n",
       "36                       Arachnodactyly        0.000024  "
      ]
     },
     "execution_count": 89,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# make sure we're rejecting some\n",
    "\n",
    "result_table.sort_values(by=['corrected_pval'], ascending=False).head(15)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Normalization on phenotypic frequency\n",
    "For a single disease to phenotype association, the HPOAs provide a frequency field, defined as the frequency of patients that show a particular clinical feature. Examples are Obligate, Frequent, and Occasional.\n",
    "\n",
    "We can use this data to further weight/normalize phenotypic co-occurrence data.  For example, if two phenotypes occur \"very frequently\" in the same disease, this would be weighted higher than if one phenotype occurs very frequently, and one occurs occasionally.  We consider the intersection the minimum frequency between two phenotypes.  In addition, the total disease count will be adjusted to account for frequency.\n",
    "\n",
    "As a test we will set the following weights:\n",
    "\n",
    "| Frequency    | Definition     | Weight |\n",
    "|:-------------|:----------------|:--------|\n",
    "|Excluded      |present in 0%    | 0      |\n",
    "|Very rare     |present in 1-4%  |. 25    |\n",
    "|Occasional    |present in 5-29% |1.7    |\n",
    "|Frequent      |present in 30-79%|5.45    |\n",
    "|Very frequent |present in 80-99%|8.95    |\n",
    "|Obligate      |present in 100%|10    |\n",
    "|Not provided  ||4    |"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 104,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style>\n",
       "    .dataframe thead tr:only-child th {\n",
       "        text-align: right;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: left;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>disease</th>\n",
       "      <th>disease_curie</th>\n",
       "      <th>phenotype</th>\n",
       "      <th>phenotype_curie</th>\n",
       "      <th>phenotype_frequency</th>\n",
       "      <th>q_phenotype_frequency</th>\n",
       "      <th>qphenotype_curie</th>\n",
       "      <th>query_phenotype</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>X-linked intellectual disability, Cilliers type</td>\n",
       "      <td>MONDO:0015600</td>\n",
       "      <td>Decreased testicular size</td>\n",
       "      <td>HP:0008734</td>\n",
       "      <td>8.95</td>\n",
       "      <td>8.95</td>\n",
       "      <td>HP:0000426</td>\n",
       "      <td>Prominent nasal bridge</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>X-linked intellectual disability, Cilliers type</td>\n",
       "      <td>MONDO:0015600</td>\n",
       "      <td>Intellectual disability, mild</td>\n",
       "      <td>HP:0001256</td>\n",
       "      <td>8.95</td>\n",
       "      <td>8.95</td>\n",
       "      <td>HP:0000426</td>\n",
       "      <td>Prominent nasal bridge</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>X-linked intellectual disability, Cilliers type</td>\n",
       "      <td>MONDO:0015600</td>\n",
       "      <td>Failure to thrive</td>\n",
       "      <td>HP:0001508</td>\n",
       "      <td>8.95</td>\n",
       "      <td>8.95</td>\n",
       "      <td>HP:0000426</td>\n",
       "      <td>Prominent nasal bridge</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>X-linked intellectual disability, Cilliers type</td>\n",
       "      <td>MONDO:0015600</td>\n",
       "      <td>Small nail</td>\n",
       "      <td>HP:0001792</td>\n",
       "      <td>8.95</td>\n",
       "      <td>8.95</td>\n",
       "      <td>HP:0000426</td>\n",
       "      <td>Prominent nasal bridge</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>X-linked intellectual disability, Cilliers type</td>\n",
       "      <td>MONDO:0015600</td>\n",
       "      <td>Abnormal facial shape</td>\n",
       "      <td>HP:0001999</td>\n",
       "      <td>8.95</td>\n",
       "      <td>8.95</td>\n",
       "      <td>HP:0000426</td>\n",
       "      <td>Prominent nasal bridge</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                           disease  disease_curie  \\\n",
       "0  X-linked intellectual disability, Cilliers type  MONDO:0015600   \n",
       "1  X-linked intellectual disability, Cilliers type  MONDO:0015600   \n",
       "2  X-linked intellectual disability, Cilliers type  MONDO:0015600   \n",
       "3  X-linked intellectual disability, Cilliers type  MONDO:0015600   \n",
       "4  X-linked intellectual disability, Cilliers type  MONDO:0015600   \n",
       "\n",
       "                       phenotype phenotype_curie  phenotype_frequency  \\\n",
       "0      Decreased testicular size      HP:0008734                 8.95   \n",
       "1  Intellectual disability, mild      HP:0001256                 8.95   \n",
       "2              Failure to thrive      HP:0001508                 8.95   \n",
       "3                     Small nail      HP:0001792                 8.95   \n",
       "4          Abnormal facial shape      HP:0001999                 8.95   \n",
       "\n",
       "   q_phenotype_frequency qphenotype_curie         query_phenotype  \n",
       "0                   8.95       HP:0000426  Prominent nasal bridge  \n",
       "1                   8.95       HP:0000426  Prominent nasal bridge  \n",
       "2                   8.95       HP:0000426  Prominent nasal bridge  \n",
       "3                   8.95       HP:0000426  Prominent nasal bridge  \n",
       "4                   8.95       HP:0000426  Prominent nasal bridge  "
      ]
     },
     "execution_count": 104,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "import pandas as pd\n",
    "from neo4j.v1 import GraphDatabase\n",
    "\n",
    "# Frequency weight map\n",
    "freq_weights = {\n",
    "    'HP:0040285': 0,\n",
    "    'HP:0040284': .25,\n",
    "    'HP:0040283': 1.7,\n",
    "    'HP:0040282': 5.45,\n",
    "    'HP:0040281': 8.95,\n",
    "    'HP:0040280': 10,\n",
    "    'unknown':    4 # Not sure how to boost this\n",
    "}\n",
    "\n",
    "# Result table\n",
    "result_table = pd.DataFrame()\n",
    "\n",
    "# Note this query would be a lot shorter if frequencies were edge properties\n",
    "cypher_query = \"\"\"\n",
    "      MATCH (disease:disease)-[:RO:0002200]->(p1:Node{iri:'%s'}),\n",
    "            (disease)-[:RO:0002200]->(p2:Phenotype)\n",
    "      WHERE p1 <> p2\n",
    "      RETURN DISTINCT p1, p2, disease\n",
    "      \"\"\" % phenotype\n",
    "\n",
    "params = {\n",
    "    'cypherQuery': cypher_query\n",
    "}\n",
    "\n",
    "scigraph_req = requests.get(scigraph_resolve, params=params)\n",
    "resolved_query = scigraph_req.text # Resolve curies to IRIs\n",
    "\n",
    "scigraph_bolt = \"bolt://neo4j.monarchinitiative.org:443\"\n",
    "driver = GraphDatabase.driver(scigraph_bolt, auth=(\"neo4j\", \"neo4j\"))\n",
    "\n",
    "def get_scigraph_results(query):\n",
    "    with driver.session() as session:\n",
    "        with session.begin_transaction() as tx:\n",
    "            for record in tx.run(query):\n",
    "                yield record\n",
    "                \n",
    "solr = 'https://solr-dev.monarchinitiative.org/solr/golr/select/'\n",
    "res_objects = []\n",
    "            \n",
    "for result in get_scigraph_results(resolved_query):\n",
    "    row = {}\n",
    "    row['query_phenotype'] = result['p1']['label']\n",
    "    row['phenotype'] = result['p2']['label']\n",
    "    row['disease'] = result['disease']['label']\n",
    "    row['qphenotype_curie'] = result['p1']['iri'].replace(\"http://purl.obolibrary.org/obo/HP_\", \"HP:\")\n",
    "    row['phenotype_curie'] = result['p2']['iri'].replace(\"http://purl.obolibrary.org/obo/HP_\", \"HP:\")\n",
    "    row['disease_curie'] = result['disease']['iri'].replace(\"http://purl.obolibrary.org/obo/MONDO_\", \"MONDO:\")\n",
    "    \n",
    "    params = {\n",
    "      \"fq\": [\n",
    "        'subject:\"{0}\"'.format(row['disease_curie']),\n",
    "        'object:\"{0}\" OR object:\"{1}\"'\\\n",
    "            .format(row['qphenotype_curie'],row['phenotype_curie'])\n",
    "      ],\n",
    "      \"rows\": \"2\",\n",
    "      \"q\": \"*:*\",\n",
    "      \"wt\": \"json\",\n",
    "      \"fl\": \"object,frequency\"\n",
    "    }\n",
    "    \n",
    "    solr_req = requests.get(solr, params=params)\n",
    "    solr_docs = solr_req.json()\n",
    "    if solr_docs['response']['numFound'] > 2:\n",
    "        print(solr_docs)\n",
    "        raise ValueError(\"Unexpected number of docs\")\n",
    "    for doc in solr_docs['response']['docs']:\n",
    "        if doc['object'] == row['qphenotype_curie']:\n",
    "            freq_p1 = doc['frequency'] if 'frequency' in doc else 'unknown'\n",
    "        elif doc['object'] == row['phenotype_curie']:\n",
    "            freq_p2 = doc['frequency'] if 'frequency' in doc else 'unknown'\n",
    "    \n",
    "    row['q_phenotype_frequency'] = freq_weights[freq_p1]\n",
    "    row['phenotype_frequency'] = freq_weights[freq_p2]\n",
    "    \n",
    "    result_table = result_table.append(row, ignore_index=True)\n",
    "    \n",
    "result_table.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 107,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "5119"
      ]
     },
     "execution_count": 107,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "len(result_table.index)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 101,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style>\n",
       "    .dataframe thead tr:only-child th {\n",
       "        text-align: right;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: left;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>intersection</th>\n",
       "      <th>phenotype</th>\n",
       "      <th>phenotype_curie</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>47</th>\n",
       "      <td>298.20</td>\n",
       "      <td>Global developmental delay</td>\n",
       "      <td>HP:0001263</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>283.95</td>\n",
       "      <td>Microcephaly</td>\n",
       "      <td>HP:0000252</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>280.80</td>\n",
       "      <td>Short stature</td>\n",
       "      <td>HP:0004322</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>60</th>\n",
       "      <td>275.10</td>\n",
       "      <td>Intellectual disability</td>\n",
       "      <td>HP:0001249</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>27</th>\n",
       "      <td>213.90</td>\n",
       "      <td>Micrognathia</td>\n",
       "      <td>HP:0000347</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>67</th>\n",
       "      <td>212.20</td>\n",
       "      <td>Downslanted palpebral fissures</td>\n",
       "      <td>HP:0000494</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>185.35</td>\n",
       "      <td>Cryptorchidism</td>\n",
       "      <td>HP:0000028</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>29</th>\n",
       "      <td>184.05</td>\n",
       "      <td>High palate</td>\n",
       "      <td>HP:0000218</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>72</th>\n",
       "      <td>180.30</td>\n",
       "      <td>Low-set ears</td>\n",
       "      <td>HP:0000369</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>92</th>\n",
       "      <td>172.25</td>\n",
       "      <td>Hypertelorism</td>\n",
       "      <td>HP:0000316</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "    intersection                       phenotype phenotype_curie\n",
       "47        298.20      Global developmental delay      HP:0001263\n",
       "12        283.95                    Microcephaly      HP:0000252\n",
       "19        280.80                   Short stature      HP:0004322\n",
       "60        275.10         Intellectual disability      HP:0001249\n",
       "27        213.90                    Micrognathia      HP:0000347\n",
       "67        212.20  Downslanted palpebral fissures      HP:0000494\n",
       "10        185.35                  Cryptorchidism      HP:0000028\n",
       "29        184.05                     High palate      HP:0000218\n",
       "72        180.30                    Low-set ears      HP:0000369\n",
       "92        172.25                   Hypertelorism      HP:0000316"
      ]
     },
     "execution_count": 101,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "aggregate_table = pd.DataFrame()\n",
    "\n",
    "phenotypes = result_table['phenotype'].unique()\n",
    "\n",
    "for pheno in phenotypes:\n",
    "    group_by_pheno = result_table[result_table['phenotype'] == pheno]\n",
    "    intersection = group_by_pheno.loc[:, ['phenotype_frequency', 'q_phenotype_frequency']].min(axis=1).sum()\n",
    "    row = {\n",
    "        'phenotype': pheno,\n",
    "        'phenotype_curie': group_by_pheno.iloc[0]['phenotype_curie'],\n",
    "        'intersection': intersection\n",
    "    }\n",
    "    aggregate_table = aggregate_table.append(row, ignore_index=True)\n",
    "\n",
    "aggregate_table.sort_values(by=['intersection'], ascending=False).head(10)\n",
    "    "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "The top ten look similar to our original top ten list. However, we still need to normalize this data.  For the next step we will leverage our solr cache.  Solr/Golr is useful because we can toggle between treating phenotype disease annotations as flat or querying grouping classes (when applicable, such as microcephaly)."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 102,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style>\n",
       "    .dataframe thead tr:only-child th {\n",
       "        text-align: right;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: left;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>intersection</th>\n",
       "      <th>phenotype</th>\n",
       "      <th>phenotype_curie</th>\n",
       "      <th>p2_count</th>\n",
       "      <th>p1_count</th>\n",
       "      <th>jaccard_sim</th>\n",
       "      <th>ochiai_coeff</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>366</th>\n",
       "      <td>104.20</td>\n",
       "      <td>Long face</td>\n",
       "      <td>HP:0000276</td>\n",
       "      <td>518.70</td>\n",
       "      <td>647.5</td>\n",
       "      <td>0.098117</td>\n",
       "      <td>0.179800</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>67</th>\n",
       "      <td>212.20</td>\n",
       "      <td>Downslanted palpebral fissures</td>\n",
       "      <td>HP:0000494</td>\n",
       "      <td>1796.65</td>\n",
       "      <td>647.5</td>\n",
       "      <td>0.095074</td>\n",
       "      <td>0.196740</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>29</th>\n",
       "      <td>184.05</td>\n",
       "      <td>High palate</td>\n",
       "      <td>HP:0000218</td>\n",
       "      <td>1885.75</td>\n",
       "      <td>647.5</td>\n",
       "      <td>0.078346</td>\n",
       "      <td>0.166561</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>116</th>\n",
       "      <td>68.90</td>\n",
       "      <td>Low anterior hairline</td>\n",
       "      <td>HP:0000294</td>\n",
       "      <td>302.80</td>\n",
       "      <td>647.5</td>\n",
       "      <td>0.078171</td>\n",
       "      <td>0.155604</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>68</th>\n",
       "      <td>88.05</td>\n",
       "      <td>Thin vermilion border</td>\n",
       "      <td>HP:0000233</td>\n",
       "      <td>571.00</td>\n",
       "      <td>647.5</td>\n",
       "      <td>0.077889</td>\n",
       "      <td>0.144808</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>116.15</td>\n",
       "      <td>Macrotia</td>\n",
       "      <td>HP:0000400</td>\n",
       "      <td>970.85</td>\n",
       "      <td>647.5</td>\n",
       "      <td>0.077320</td>\n",
       "      <td>0.146495</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>106</th>\n",
       "      <td>96.05</td>\n",
       "      <td>Short philtrum</td>\n",
       "      <td>HP:0000322</td>\n",
       "      <td>720.40</td>\n",
       "      <td>647.5</td>\n",
       "      <td>0.075520</td>\n",
       "      <td>0.140634</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>71</th>\n",
       "      <td>116.75</td>\n",
       "      <td>Narrow mouth</td>\n",
       "      <td>HP:0000160</td>\n",
       "      <td>1020.75</td>\n",
       "      <td>647.5</td>\n",
       "      <td>0.075250</td>\n",
       "      <td>0.143608</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>187</th>\n",
       "      <td>99.25</td>\n",
       "      <td>Posteriorly rotated ears</td>\n",
       "      <td>HP:0000358</td>\n",
       "      <td>813.40</td>\n",
       "      <td>647.5</td>\n",
       "      <td>0.072890</td>\n",
       "      <td>0.136760</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>124</th>\n",
       "      <td>74.65</td>\n",
       "      <td>Highly arched eyebrow</td>\n",
       "      <td>HP:0002553</td>\n",
       "      <td>461.75</td>\n",
       "      <td>647.5</td>\n",
       "      <td>0.072153</td>\n",
       "      <td>0.136523</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>334</th>\n",
       "      <td>75.45</td>\n",
       "      <td>Underdeveloped nasal alae</td>\n",
       "      <td>HP:0000430</td>\n",
       "      <td>495.80</td>\n",
       "      <td>647.5</td>\n",
       "      <td>0.070656</td>\n",
       "      <td>0.133164</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>91</th>\n",
       "      <td>164.10</td>\n",
       "      <td>Wide nasal bridge</td>\n",
       "      <td>HP:0000431</td>\n",
       "      <td>1886.15</td>\n",
       "      <td>647.5</td>\n",
       "      <td>0.069254</td>\n",
       "      <td>0.148491</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>64</th>\n",
       "      <td>69.90</td>\n",
       "      <td>Sloping forehead</td>\n",
       "      <td>HP:0000340</td>\n",
       "      <td>436.25</td>\n",
       "      <td>647.5</td>\n",
       "      <td>0.068945</td>\n",
       "      <td>0.131519</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>115</th>\n",
       "      <td>162.80</td>\n",
       "      <td>Epicanthus</td>\n",
       "      <td>HP:0000286</td>\n",
       "      <td>1985.40</td>\n",
       "      <td>647.5</td>\n",
       "      <td>0.065908</td>\n",
       "      <td>0.143585</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>190</th>\n",
       "      <td>64.65</td>\n",
       "      <td>Prominent nose</td>\n",
       "      <td>HP:0000448</td>\n",
       "      <td>411.90</td>\n",
       "      <td>647.5</td>\n",
       "      <td>0.064991</td>\n",
       "      <td>0.125185</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "     intersection                       phenotype phenotype_curie  p2_count  \\\n",
       "366        104.20                       Long face      HP:0000276    518.70   \n",
       "67         212.20  Downslanted palpebral fissures      HP:0000494   1796.65   \n",
       "29         184.05                     High palate      HP:0000218   1885.75   \n",
       "116         68.90           Low anterior hairline      HP:0000294    302.80   \n",
       "68          88.05           Thin vermilion border      HP:0000233    571.00   \n",
       "16         116.15                        Macrotia      HP:0000400    970.85   \n",
       "106         96.05                  Short philtrum      HP:0000322    720.40   \n",
       "71         116.75                    Narrow mouth      HP:0000160   1020.75   \n",
       "187         99.25        Posteriorly rotated ears      HP:0000358    813.40   \n",
       "124         74.65           Highly arched eyebrow      HP:0002553    461.75   \n",
       "334         75.45       Underdeveloped nasal alae      HP:0000430    495.80   \n",
       "91         164.10               Wide nasal bridge      HP:0000431   1886.15   \n",
       "64          69.90                Sloping forehead      HP:0000340    436.25   \n",
       "115        162.80                      Epicanthus      HP:0000286   1985.40   \n",
       "190         64.65                  Prominent nose      HP:0000448    411.90   \n",
       "\n",
       "     p1_count  jaccard_sim  ochiai_coeff  \n",
       "366     647.5     0.098117      0.179800  \n",
       "67      647.5     0.095074      0.196740  \n",
       "29      647.5     0.078346      0.166561  \n",
       "116     647.5     0.078171      0.155604  \n",
       "68      647.5     0.077889      0.144808  \n",
       "16      647.5     0.077320      0.146495  \n",
       "106     647.5     0.075520      0.140634  \n",
       "71      647.5     0.075250      0.143608  \n",
       "187     647.5     0.072890      0.136760  \n",
       "124     647.5     0.072153      0.136523  \n",
       "334     647.5     0.070656      0.133164  \n",
       "91      647.5     0.069254      0.148491  \n",
       "64      647.5     0.068945      0.131519  \n",
       "115     647.5     0.065908      0.143585  \n",
       "190     647.5     0.064991      0.125185  "
      ]
     },
     "execution_count": 102,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "import math\n",
    "\n",
    "# Pull down whole pivot table\n",
    "solr = 'https://solr-dev.monarchinitiative.org/solr/golr/select/'\n",
    "params = {\n",
    "  \"facet.pivot\": \"object,frequency\",\n",
    "  \"fq\": [\n",
    "    \"subject_category:disease\",\n",
    "    \"object_category:phenotype\"\n",
    "  ],\n",
    "  \"rows\": \"0\",\n",
    "  \"q\": \"*:*\",\n",
    "  \"facet.limit\": \"12000\", # Should get all of HPO\n",
    "  \"f.object_closure.facet.prefix\": \"HP\",\n",
    "  \"facet.method\": \"enum\",\n",
    "  \"facet.mincount\": \"1\",\n",
    "  \"facet\": \"true\",\n",
    "  \"wt\": \"json\",\n",
    "  \"facet.sort\": \"count\"\n",
    "};\n",
    "\n",
    "solr_req = requests.get(solr, params=params)\n",
    "pivot_table = solr_req.json()\n",
    "\n",
    "aggregate_table['p2_count'] = 0\n",
    "phenotype_ids = result_table['phenotype_curie'].unique()\n",
    "\n",
    "\n",
    "def calculate_weighted_frequency(facet):\n",
    "    count = (int(facet['count']) - sum([freq['count'] for freq in facet['pivot']])) * freq_weights['unknown']\n",
    "    for freq in facet['pivot']:\n",
    "        count += (freq['count'] * freq_weights[freq['value']])\n",
    "    return count\n",
    "\n",
    "for facet in pivot_table['facet_counts']['facet_pivot']['object,frequency']:\n",
    "    if facet['value'] == phenotype:\n",
    "        if 'pivot' in facet:\n",
    "            count = calculate_weighted_frequency(facet)\n",
    "        else:\n",
    "            count = int(facet['count']) * freq_weights['unknown']\n",
    "        aggregate_table['p1_count'] = count\n",
    "    elif facet['value'] in phenotype_ids:\n",
    "        if 'pivot' in facet:\n",
    "            count = calculate_weighted_frequency(facet)\n",
    "        else:\n",
    "            count = int(facet['count']) * freq_weights['unknown']\n",
    "        aggregate_table.loc[(aggregate_table['phenotype_curie'] == facet['value']), \"p2_count\"] = count\n",
    "\n",
    "def calculate_jaccard(intersection, count1, count2):\n",
    "    return intersection / ((count1 + count2) - intersection)\n",
    "\n",
    "def calcuate_ochiai(intersection, count1, count2):\n",
    "    return intersection / math.sqrt(count1 * count2)\n",
    "\n",
    "\n",
    "aggregate_table['jaccard_sim'] = aggregate_table.apply(\n",
    "        func=lambda row: calculate_jaccard(\n",
    "                              row['intersection'],\n",
    "                              row['p1_count'],\n",
    "                              row['p2_count']),\n",
    "        axis=1\n",
    ")\n",
    "    \n",
    "aggregate_table['ochiai_coeff'] = aggregate_table.apply(\n",
    "        func=lambda row: calcuate_ochiai(\n",
    "                              row['intersection'],\n",
    "                              row['p1_count'],\n",
    "                              row['p2_count']),\n",
    "        axis=1\n",
    ")\n",
    "\n",
    "aggregate_table.sort_values(by=['jaccard_sim'], ascending=False).head(15)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 103,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style>\n",
       "    .dataframe thead tr:only-child th {\n",
       "        text-align: right;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: left;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>intersection</th>\n",
       "      <th>phenotype</th>\n",
       "      <th>phenotype_curie</th>\n",
       "      <th>p2_count</th>\n",
       "      <th>p1_count</th>\n",
       "      <th>jaccard_sim</th>\n",
       "      <th>ochiai_coeff</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>67</th>\n",
       "      <td>212.20</td>\n",
       "      <td>Downslanted palpebral fissures</td>\n",
       "      <td>HP:0000494</td>\n",
       "      <td>1796.65</td>\n",
       "      <td>647.5</td>\n",
       "      <td>0.095074</td>\n",
       "      <td>0.196740</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>366</th>\n",
       "      <td>104.20</td>\n",
       "      <td>Long face</td>\n",
       "      <td>HP:0000276</td>\n",
       "      <td>518.70</td>\n",
       "      <td>647.5</td>\n",
       "      <td>0.098117</td>\n",
       "      <td>0.179800</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>29</th>\n",
       "      <td>184.05</td>\n",
       "      <td>High palate</td>\n",
       "      <td>HP:0000218</td>\n",
       "      <td>1885.75</td>\n",
       "      <td>647.5</td>\n",
       "      <td>0.078346</td>\n",
       "      <td>0.166561</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>283.95</td>\n",
       "      <td>Microcephaly</td>\n",
       "      <td>HP:0000252</td>\n",
       "      <td>4489.90</td>\n",
       "      <td>647.5</td>\n",
       "      <td>0.058505</td>\n",
       "      <td>0.166534</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>116</th>\n",
       "      <td>68.90</td>\n",
       "      <td>Low anterior hairline</td>\n",
       "      <td>HP:0000294</td>\n",
       "      <td>302.80</td>\n",
       "      <td>647.5</td>\n",
       "      <td>0.078171</td>\n",
       "      <td>0.155604</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>91</th>\n",
       "      <td>164.10</td>\n",
       "      <td>Wide nasal bridge</td>\n",
       "      <td>HP:0000431</td>\n",
       "      <td>1886.15</td>\n",
       "      <td>647.5</td>\n",
       "      <td>0.069254</td>\n",
       "      <td>0.148491</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>72</th>\n",
       "      <td>180.30</td>\n",
       "      <td>Low-set ears</td>\n",
       "      <td>HP:0000369</td>\n",
       "      <td>2308.30</td>\n",
       "      <td>647.5</td>\n",
       "      <td>0.064961</td>\n",
       "      <td>0.147479</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>116.15</td>\n",
       "      <td>Macrotia</td>\n",
       "      <td>HP:0000400</td>\n",
       "      <td>970.85</td>\n",
       "      <td>647.5</td>\n",
       "      <td>0.077320</td>\n",
       "      <td>0.146495</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>68</th>\n",
       "      <td>88.05</td>\n",
       "      <td>Thin vermilion border</td>\n",
       "      <td>HP:0000233</td>\n",
       "      <td>571.00</td>\n",
       "      <td>647.5</td>\n",
       "      <td>0.077889</td>\n",
       "      <td>0.144808</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>27</th>\n",
       "      <td>213.90</td>\n",
       "      <td>Micrognathia</td>\n",
       "      <td>HP:0000347</td>\n",
       "      <td>3391.25</td>\n",
       "      <td>647.5</td>\n",
       "      <td>0.055924</td>\n",
       "      <td>0.144348</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>71</th>\n",
       "      <td>116.75</td>\n",
       "      <td>Narrow mouth</td>\n",
       "      <td>HP:0000160</td>\n",
       "      <td>1020.75</td>\n",
       "      <td>647.5</td>\n",
       "      <td>0.075250</td>\n",
       "      <td>0.143608</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>115</th>\n",
       "      <td>162.80</td>\n",
       "      <td>Epicanthus</td>\n",
       "      <td>HP:0000286</td>\n",
       "      <td>1985.40</td>\n",
       "      <td>647.5</td>\n",
       "      <td>0.065908</td>\n",
       "      <td>0.143585</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>47</th>\n",
       "      <td>298.20</td>\n",
       "      <td>Global developmental delay</td>\n",
       "      <td>HP:0001263</td>\n",
       "      <td>6769.80</td>\n",
       "      <td>647.5</td>\n",
       "      <td>0.041887</td>\n",
       "      <td>0.142429</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>185.35</td>\n",
       "      <td>Cryptorchidism</td>\n",
       "      <td>HP:0000028</td>\n",
       "      <td>2627.45</td>\n",
       "      <td>647.5</td>\n",
       "      <td>0.059992</td>\n",
       "      <td>0.142104</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>65</th>\n",
       "      <td>170.95</td>\n",
       "      <td>Ptosis</td>\n",
       "      <td>HP:0000508</td>\n",
       "      <td>2239.45</td>\n",
       "      <td>647.5</td>\n",
       "      <td>0.062942</td>\n",
       "      <td>0.141964</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "     intersection                       phenotype phenotype_curie  p2_count  \\\n",
       "67         212.20  Downslanted palpebral fissures      HP:0000494   1796.65   \n",
       "366        104.20                       Long face      HP:0000276    518.70   \n",
       "29         184.05                     High palate      HP:0000218   1885.75   \n",
       "12         283.95                    Microcephaly      HP:0000252   4489.90   \n",
       "116         68.90           Low anterior hairline      HP:0000294    302.80   \n",
       "91         164.10               Wide nasal bridge      HP:0000431   1886.15   \n",
       "72         180.30                    Low-set ears      HP:0000369   2308.30   \n",
       "16         116.15                        Macrotia      HP:0000400    970.85   \n",
       "68          88.05           Thin vermilion border      HP:0000233    571.00   \n",
       "27         213.90                    Micrognathia      HP:0000347   3391.25   \n",
       "71         116.75                    Narrow mouth      HP:0000160   1020.75   \n",
       "115        162.80                      Epicanthus      HP:0000286   1985.40   \n",
       "47         298.20      Global developmental delay      HP:0001263   6769.80   \n",
       "10         185.35                  Cryptorchidism      HP:0000028   2627.45   \n",
       "65         170.95                          Ptosis      HP:0000508   2239.45   \n",
       "\n",
       "     p1_count  jaccard_sim  ochiai_coeff  \n",
       "67      647.5     0.095074      0.196740  \n",
       "366     647.5     0.098117      0.179800  \n",
       "29      647.5     0.078346      0.166561  \n",
       "12      647.5     0.058505      0.166534  \n",
       "116     647.5     0.078171      0.155604  \n",
       "91      647.5     0.069254      0.148491  \n",
       "72      647.5     0.064961      0.147479  \n",
       "16      647.5     0.077320      0.146495  \n",
       "68      647.5     0.077889      0.144808  \n",
       "27      647.5     0.055924      0.144348  \n",
       "71      647.5     0.075250      0.143608  \n",
       "115     647.5     0.065908      0.143585  \n",
       "47      647.5     0.041887      0.142429  \n",
       "10      647.5     0.059992      0.142104  \n",
       "65      647.5     0.062942      0.141964  "
      ]
     },
     "execution_count": 103,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "aggregate_table.sort_values(by=['ochiai_coeff'], ascending=False).head(15)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "collapsed": true
   },
   "source": [
    "For this example, adding frequency data does not seem to affect the results much with the exception that _low anterior hairline_ is upranked in the frequency aware lists.\n",
    "\n",
    "Follow up questions:\n",
    "- What genes are associated with this group of phenotypes?\n",
    "- What processes and pathways are associated with these genes?\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.5.2"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
